Breakpoint 1, f (n=738, m=13, str=0xbffff8c8 "testFile") at ex1.c:29
29		buf[m] = 0;
(gdb) x/128xw 0xbffff3a0
0xbffff3a0:	0x6b72614d	0x6f685420	0x6f73706d	0x9090906e
0xbffff3b0:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff3c0:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff3d0:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff3e0:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff3f0:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff400:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff410:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff420:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff430:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff440:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff450:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff460:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff470:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff480:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff490:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff4a0:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff4b0:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff4c0:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff4d0:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff4e0:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff4f0:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff500:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff510:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff520:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff530:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff540:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff550:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff560:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff570:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff580:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff590:	0x90909090	0x90909090	0x90909090	0x90909090
(gdb) 
0xbffff5a0:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff5b0:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff5c0:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff5d0:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff5e0:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff5f0:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff600:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff610:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff620:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff630:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff640:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff650:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff660:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff670:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff680:	0x90909090	0x90909090	0xbffff6d8	0xb7e6d3ff
0xbffff690:	0xbffff3a0	0x000002e1	0x0804b008	0x000002e8
0xbffff6a0:	0xb7fcdac0	0x00000004	0xbffff6d8	0x0804898a
0xbffff6b0:	0x000002e2	0x0000000d	0xbffff8c8	0xbffff8bf
0xbffff6c0:	0xb7fcd3c4	0xb7fff000	0x0000000d	0x000002e2
0xbffff6d0:	0x080489a0	0xb7fcd000	0x00000000	0xb7e39af3
0xbffff6e0:	0x00000004	0xbffff774	0xbffff788	0xb7fece6a
0xbffff6f0:	0x00000004	0xbffff774	0xbffff714	0x0804a030
0xbffff700:	0x080482f8	0xb7fcd000	0x00000000	0x00000000
0xbffff710:	0x00000000	0xa4ec558d	0x9c34f19d	0x00000000
0xbffff720:	0x00000000	0x00000000	0x00000004	0x08048590
0xbffff730:	0x00000000	0xb7ff2660	0xb7e39a09	0xb7fff000
0xbffff740:	0x00000004	0x08048590	0x00000000	0x080485b1
0xbffff750:	0x0804882f	0x00000004	0xbffff774	0x080489a0
0xbffff760:	0x08048a10	0xb7fed300	0xbffff76c	0x0000001c
0xbffff770:	0x00000004	0xbffff8ab	0xbffff8ba	0xbffff8bf
0xbffff780:	0xbffff8c8	0x00000000	0xbffff8d1	0xbffff8e2
0xbffff790:	0xbffff8f2	0xbffff906	0xbffff928	0xbffff93b
(gdb) info reg
eax            0x2e8	744
ecx            0x804b0a0	134525088
edx            0x2e8	744
ebx            0xbffff680	-1073744256
esp            0xbffff390	0xbffff390
ebp            0xbffff6a8	0xbffff6a8
esi            0x0	0
edi            0x0	0
eip            0x80487ab	0x80487ab <f+286>
eflags         0x282	[ SF IF ]
cs             0x73	115
ss             0x7b	123
ds             0x7b	123
es             0x7b	123
fs             0x0	0
gs             0x33	51
(gdb) q
A debugging session is active.

	Inferior 1 [process 13640] will be killed.

Quit anyway? (y or n) y
mark@wreckme:~$ gdb --args ex1 Mark Thompson testFile
GNU gdb (Ubuntu 7.7.1-0ubuntu5~14.04.3) 7.7.1
Copyright (C) 2014 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "i686-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from ex1...done.
(gdb) b ex1.c:27
Breakpoint 1 at 0x804878a: file ex1.c, line 27.
(gdb) b ex1.c:29
Breakpoint 2 at 0x80487ab: file ex1.c, line 29.
(gdb) run
Starting program: /home/mark/ex1 Mark Thompson testFile
Numbers (m, n): 738 13
Provided name: Mark Thompson
Reading file into buffer at 0xbffff3a0

Breakpoint 1, f (n=738, m=13, str=0xbffff8c8 "testFile") at ex1.c:27
27		fread(buf, sizeof(buf[0]), pos, f);
(gdb) c
Continuing.

Breakpoint 2, f (n=738, m=13, str=0xbffff8c8 "testFile") at ex1.c:29
29		buf[m] = 0;
(gdb) info reg
eax            0x308	776
ecx            0x804b0a0	134525088
edx            0x308	776
ebx            0xbffff680	-1073744256
esp            0xbffff390	0xbffff390
ebp            0xbffff6a8	0xbffff6a8
esi            0x0	0
edi            0x0	0
eip            0x80487ab	0x80487ab <f+286>
eflags         0x282	[ SF IF ]
cs             0x73	115
ss             0x7b	123
ds             0x7b	123
es             0x7b	123
fs             0x0	0
gs             0x33	51
(gdb) x/128xw 0xbffff3a0
0xbffff3a0:	0x6b72614d	0x6f685420	0x6f73706d	0x9090906e
0xbffff3b0:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff3c0:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff3d0:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff3e0:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff3f0:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff400:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff410:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff420:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff430:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff440:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff450:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff460:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff470:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff480:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff490:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff4a0:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff4b0:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff4c0:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff4d0:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff4e0:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff4f0:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff500:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff510:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff520:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff530:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff540:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff550:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff560:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff570:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff580:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff590:	0x90909090	0x90909090	0x90909090	0x90909090
(gdb) 
0xbffff5a0:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff5b0:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff5c0:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff5d0:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff5e0:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff5f0:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff600:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff610:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff620:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff630:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff640:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff650:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff660:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff670:	0x90909090	0x90909090	0x90909090	0x90909090
0xbffff680:	0x90909090	0x90909090	0xbffff6d8	0xb7e6d3ff
0xbffff690:	0xbffff3a0	0x000002e1	0x0804b008	0x000002e8
0xbffff6a0:	0xb7fcdac0	0x00000004	0xbffff6d8	0x0804898a
0xbffff6b0:	0x000002e2	0x0000000d	0xbffff8c8	0xbffff8bf
0xbffff6c0:	0xb7fcd3c4	0xb7fff000	0x0000000d	0x000002e2
0xbffff6d0:	0x080489a0	0xb7fcd000	0x00000000	0xb7e39af3
0xbffff6e0:	0x00000004	0xbffff774	0xbffff788	0xb7fece6a
0xbffff6f0:	0x00000004	0xbffff774	0xbffff714	0x0804a030
0xbffff700:	0x080482f8	0xb7fcd000	0x00000000	0x00000000
0xbffff710:	0x00000000	0x88ff6db5	0xb027c9a5	0x00000000
0xbffff720:	0x00000000	0x00000000	0x00000004	0x08048590
0xbffff730:	0x00000000	0xb7ff2660	0xb7e39a09	0xb7fff000
0xbffff740:	0x00000004	0x08048590	0x00000000	0x080485b1
0xbffff750:	0x0804882f	0x00000004	0xbffff774	0x080489a0
0xbffff760:	0x08048a10	0xb7fed300	0xbffff76c	0x0000001c
0xbffff770:	0x00000004	0xbffff8ab	0xbffff8ba	0xbffff8bf
0xbffff780:	0xbffff8c8	0x00000000	0xbffff8d1	0xbffff8e2
0xbffff790:	0xbffff8f2	0xbffff906	0xbffff928	0xbffff93b
(gdb) 